// 3.
// Реалізуйте функцію calcRectangleArea(width, height), 
// яка приймає 2 параметри ширина прямокутника width і висота прямокутника height і обраховує його площу. 
// Передбачити припинення виконання програми і генерацію винятку у випадку, якщо функції передано не числові параметри.
// Напишіть код, який використовує цю функцію та обробляє можливі виняткові ситуації.

function calcRectangleArea(width, height) {
	if(isNaN(width) || isNaN(height)) {
		console.log('Введіть числові дані');
	} else if (width <= 0 || height <= 0) {
		console.log('Введені дані не можуть дорівнювати нулю або бути від\'ємними');
	} else if(width === height) {
		console.log('Введені дані не можуть бути рівні');
	} else {
		console.log(width * height);
	}
}

let rectacular = calcRectangleArea('12', -1);
console.log(rectacular);

// Я правильно зрозуміла,що в даному випадку підходить медод isNaN()? 
// Типу якшо число буде введено як строка, то площа порахується, але якщо там числа не буде, а будуть букви чи символи - то виведу помилку?

